#include <stdio.h>

int main(void)
{
	/*
	//定义了一个int类型的变量i   定义了一个int类型的数组
	数组名为a   可以存放六个数据
	*/
	int i,a[6];   
	
	for(i=0;i<=5;i++)   //循环的作用是：将值赋值给数组
	{
		a[i] = i*2;   
	}
	
	/*
	当i=0时：   0<6
		a[i] = i*2  -----  a[0] = 0*2 =0;
		i++  ---  i=1;
	当i=1时：   1<6
		a[i] = i*2  ------ a[1] = 1*2 = 2;
		i++  ---  i=2;
	当i=2时： 	3<6
		a[i] = i*2  ------- a[2] = 2*2  = 4;
		i++  ---- i=3;
		.............
	*/
	
	for(i=5;i>=0;i--)    //倒着打印数组
	{
		printf("a[%d]:%d\t",i,a[i]);
	}
	
	printf("\n");
	return 0;
}